[M_Orchid_PlotMission06 MissionDefinition]
MissionDescription="Herbert, like many people on Pandora, refuses to help you find the final piece of Captain Blade's compass until you do a favor for him. He has also -- again, like many people on Pandora -- hidden a few audio recordings in the areas surrounding his home in [place]the Rustyards[-place]. He has asked you to return his recordings. Once you've done so, he'll be happy to lead you to the final piece of Captain Blade's compass."
MissionSummary="Find Herbert's recordings."
MissionGiver="Herbert the Hermit"
MissionTurnInLocation="Herbert the Hermit"

[M_Orchid_PlotMission06:ShootLock MissionObjectiveDefinition]
ProgressMessage="Shoot lock"
